In [9]:
import pandas as pd
import io
import requests
url="https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
s=requests.get(url).content
csv=pd.read_csv(io.StringIO(s.decode('utf-8')))

In [10]:
csv

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [15]:
print(f"Shape of table: {csv.shape}")

Shape of table: (5, 5)

In [16]:
print(f"Number of rows: {len(list(csv))}")

Number of rows: 5

In [22]:
print(f"Header includes: {list(pd.read_csv(url,sep='|',nrows=1).columns)}")

Header includes: ['Name,People,Area,BIP,Currency']

In [23]:
csv.min()

Name        Brazilia
People      36503097
Area          301338
BIP             1529
Currency         CAD
dtype: object

In [24]:
csv.max()

Name            Japan
People      208360000
Area          9984670
BIP              4938
Currency          YEN
dtype: object

In [25]:
csv.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [26]:
csv[csv['Currency'] == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [27]:
currency = csv[['Name', 'Currency']]
currency

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [28]:
csv[csv['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [29]:
csv[(csv['People'] >= 50000000) & (csv['People'] <= 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [30]:
csv.rename(columns={'BIP':'Bip'}, inplace=True)
csv

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [31]:
csv['Bip'].sum()

13581

In [32]:
csv['People'].mean()

102786293.6

In [33]:
csv.sort_values(by=['Name'])

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN